# COGS 118A: Final Project
## By Stanley Hahm A14609365

Below is the my process of cleansing my datasets in order to make them ready for analyzing & training.

***Keywords:*** One-hot encoding, Data mapping, Data cleaning

* There was a NURSE dataset that ended up being taken out of the final project, but I still include how I cleansed it as well here.

## Data Cleaning
### ADULT Dataset

In [1]:
import numpy as np 
import pandas as pd
from sklearn import datasets

In [2]:
adult = pd.read_csv('adult.data')
adult.columns = ['age', 'workclass', 'fnlwgt', 'education', 'education num', 'marital status', 'occupation', 'relationship', 'race', 'sex', 'capital gain', 'capital loss', 'hours per week', 'country', 'income']
adult.head()

,age,workclass,fnlwgt,education,education num,marital status,occupation,relationship,race,sex,capital gain,capital loss,hours per week,country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [3]:
adult.shape

(32560, 15)

In [4]:
adult.isin([' ?']).sum(axis=0)

age                  0
workclass         1836
fnlwgt               0
education            0
education num        0
marital status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital gain         0
capital loss         0
hours per week       0
country            583
income               0
dtype: int64

In [5]:
adult['workclass'] = adult['workclass'].replace(' ?', np.nan)
adult['occupation'] = adult['occupation'].replace(' ?', np.nan)
adult['country'] = adult['country'].replace(' ?', np.nan)
adult.dropna(how='any', inplace=True)

In [6]:
adult.shape

(30161, 15)

In [7]:
adult.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education num     0
marital status    0
occupation        0
relationship      0
race              0
sex               0
capital gain      0
capital loss      0
hours per week    0
country           0
income            0
dtype: int64

In [8]:
adult.drop(['fnlwgt'], axis=1, inplace=True)
adult.head()

,age,workclass,education,education num,marital status,occupation,relationship,race,sex,capital gain,capital loss,hours per week,country,income
0,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [9]:
adult['age'].unique()

array([50, 38, 53, 28, 37, 49, 52, 31, 42, 30, 23, 32, 34, 25, 43, 40, 54,
       35, 59, 56, 19, 39, 20, 45, 22, 48, 21, 24, 57, 44, 41, 29, 47, 46,
       36, 79, 27, 18, 33, 76, 55, 61, 70, 64, 71, 66, 51, 58, 26, 17, 60,
       90, 75, 65, 77, 62, 63, 67, 74, 72, 69, 68, 73, 81, 78, 88, 80, 84,
       83, 85, 82, 86])

In [10]:
adult['education num'].unique()

array([13,  9,  7, 14,  5, 10, 12,  4, 16, 11, 15,  3,  6,  1,  8,  2])

In [11]:
adult['capital gain'].unique()

array([    0, 14084,  5178,  5013,  2407, 14344, 15024,  7688,  4064,
        4386,  7298,  1409,  3674,  1055,  2050,  2176,  2174,   594,
       20051,  6849,  4101,  8614,  3411,  2597, 25236,  4650,  2463,
        3103, 10605,  2964,  3325,  2580,  3471,  4865, 99999,  6514,
        1471,  2329,  2105,  2885, 10520,  2202,  2961, 27828,  6767,
        2228,  1506, 13550,  2635,  5556,  4787,  3781,  3137,  3818,
         914,   401,  2829,  2977,  4934,  2062,  2354,  3464,  5455,
       15020,  1424,  3273, 22040,  4416, 10566,  4931,  7430, 34095,
        6497,  3908,   114,  2346,  2907,  1151,  9386,  2414,  2290,
        3418, 15831, 41310,  4508,  2538,  3456,  1848,  3887,  7896,
        5721,  9562,  6418,  1455,  2036,  3942,  1831, 11678,  2936,
        2993,  7443,  6360,  4687,  1797,  6723,  2009,  3432,  6097,
        1639,  2653, 18481, 25124,  7978,   991,  1173,  2387,  5060,
        1086])

#### One Hot Encoding

In [12]:
adult['workclass'].unique()

array([' Self-emp-not-inc', ' Private', ' State-gov', ' Federal-gov',
       ' Local-gov', ' Self-emp-inc', ' Without-pay'], dtype=object)

In [13]:
adult['workclass'] = adult['workclass'].map({' Self-emp-not-inc': 0,
                                            ' Self-emp-inc': 1,
                                            ' Local-gov': 2,
                                            ' State-gov': 3,
                                            ' Federal-gov': 4,
                                            ' Private': 5,
                                            ' Without-pay': 6,})

In [14]:
adult['education'].unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' 7th-8th', ' Doctorate',
       ' Assoc-voc', ' Prof-school', ' 5th-6th', ' 10th', ' Preschool',
       ' 12th', ' 1st-4th'], dtype=object)

In [15]:
adult['education'] = adult['education'].map({' Preschool': 0,
                                            ' 1st-4th': 1,
                                            ' 5th-6th': 2,
                                            ' 7th-8th': 3,
                                            ' 9th': 4,
                                            ' 10th': 5,
                                            ' 11th': 6,
                                            ' 12th': 7,
                                            ' HS-grad': 8,
                                            ' Some-college': 9,
                                            ' Assoc-acdm': 10,
                                            ' Assoc-voc': 11,
                                            ' Bachelors': 12,
                                            ' Masters': 13,
                                            ' Doctorate': 14,
                                            ' Prof-school': 15})

In [16]:
adult['marital status'].unique()

array([' Married-civ-spouse', ' Divorced', ' Married-spouse-absent',
       ' Never-married', ' Separated', ' Married-AF-spouse', ' Widowed'],
      dtype=object)

In [17]:
adult['marital status'] = adult['marital status'].map({' Never-married': 0,
                                                      ' Married-civ-spouse': 1,
                                                      ' Married-AF-spouse': 2,
                                                      ' Married-spouse-absent': 3,
                                                      ' Divorced': 4,
                                                      ' Separated': 5,
                                                      ' Widowed': 6})

In [18]:
adult['occupation'].unique()

array([' Exec-managerial', ' Handlers-cleaners', ' Prof-specialty',
       ' Other-service', ' Adm-clerical', ' Sales', ' Transport-moving',
       ' Farming-fishing', ' Machine-op-inspct', ' Tech-support',
       ' Craft-repair', ' Protective-serv', ' Armed-Forces',
       ' Priv-house-serv'], dtype=object)

In [19]:
adult['occupation'] = adult['occupation'].map({' Exec-managerial': 0,
                                              ' Handlers-cleaners': 1,
                                              ' Prof-specialty': 2,
                                              ' Other-service': 3,
                                              ' Adm-clerical': 4,
                                              ' Sales': 5,
                                              ' Transport-moving': 6,
                                              ' Farming-fishing': 7,
                                              ' Machine-op-inspct': 8,
                                              ' Tech-support': 9,
                                              ' Craft-repair': 10,
                                              ' Protective-serv': 11,
                                              ' Armed-Forces': 12,
                                              ' Priv-house-serv': 13})

In [20]:
adult['relationship'].unique()

array([' Husband', ' Not-in-family', ' Wife', ' Own-child', ' Unmarried',
       ' Other-relative'], dtype=object)

In [21]:
adult['relationship'] = adult['relationship'].map({' Husband': 0,
                                                  ' Not-in-family': 1,
                                                  ' Wife': 2,
                                                  ' Own-child': 3,
                                                  ' Unmarried': 4,
                                                  ' Other-relative': 5})

In [22]:
adult['race'].unique()

array([' White', ' Black', ' Asian-Pac-Islander', ' Amer-Indian-Eskimo',
       ' Other'], dtype=object)

In [23]:
adult['race'] = adult['race'].map({' White': 0, ' Black': 1, 
                                  ' Asian-Pac-Islander': 2,
                                  ' Amer-Indian-Eskimo': 3,
                                  ' Other': 4})

In [24]:
adult['country'].unique()

array([' United-States', ' Cuba', ' Jamaica', ' India', ' Mexico',
       ' Puerto-Rico', ' Honduras', ' England', ' Canada', ' Germany',
       ' Iran', ' Philippines', ' Poland', ' Columbia', ' Cambodia',
       ' Thailand', ' Ecuador', ' Laos', ' Taiwan', ' Haiti', ' Portugal',
       ' Dominican-Republic', ' El-Salvador', ' France', ' Guatemala',
       ' Italy', ' China', ' South', ' Japan', ' Yugoslavia', ' Peru',
       ' Outlying-US(Guam-USVI-etc)', ' Scotland', ' Trinadad&Tobago',
       ' Greece', ' Nicaragua', ' Vietnam', ' Hong', ' Ireland',
       ' Hungary', ' Holand-Netherlands'], dtype=object)

In [25]:
adult['country'] = np.where(adult['country'] != ' United-States', 0, 1)

In [26]:
adult['sex'].unique()

array([' Male', ' Female'], dtype=object)

In [27]:
adult['sex'] = adult['sex'].map({' Male': 0, ' Female': 1})

In [28]:
adult['income'].unique()

array([' <=50K', ' >50K'], dtype=object)

In [29]:
adult['income'] = adult['income'].map({' <=50K': 0, ' >50K': 1})

In [30]:
adult.head()

,age,workclass,education,education num,marital status,occupation,relationship,race,sex,capital gain,capital loss,hours per week,country,income
0,50,0,12,13,1,0,0,0,0,0,0,13,1,0
1,38,5,8,9,4,1,1,0,0,0,0,40,1,0
2,53,5,6,7,1,1,0,1,0,0,0,40,1,0
3,28,5,12,13,1,2,2,1,1,0,0,40,0,0
4,37,5,13,14,1,0,2,0,1,0,0,40,1,0

In [31]:
adult.shape

(30161, 14)

In [32]:
adult['income'].value_counts()

0    22653
1     7508
Name: income, dtype: int64

### LETTER Dataset

In [33]:
letter = pd.read_csv('letter-recognition.data')
letter.columns = ['lettr', 'x-box', 'y-box', 'width', 'height', 
                  'pixels', 'x-bar', 'y-bar', 'x2bar', 'y2bar', 
                  'xybar', 'x2ybr', 'xy2br', 'x ege', 'xegvy',
                  'y-ege', 'yegvx']
letter.head()

,lettr,x-box,y-box,width,height,pixels,x-bar,y-bar,x2bar,y2bar,xybar,x2ybr,xy2br,x ege,xegvy,y-ege,yegvx
0,I,5,12,3,7,2,10,5,5,4,13,3,9,2,8,4,10
1,D,4,11,6,8,6,10,6,2,6,10,3,7,3,7,3,9
2,N,7,11,6,6,3,5,9,4,6,4,4,10,6,10,2,8
3,G,2,1,3,1,1,8,6,6,6,6,5,9,1,7,5,10
4,S,4,11,5,8,3,8,8,6,9,5,6,6,0,8,9,7

In [34]:
letter['lettr'] = letter['lettr'].map({
    'A':0, 'B':0, 'C':0, 'D':0, 'E':0, 'F':0, 'G':0, 'H':0, 'I':0,
    'J':0, 'K':0, 'L':0, 'M':0, 'N':1, 'O':1, 'P':1, 'Q':1, 'R':1,
    'S':1, 'T':1, 'U':1, 'V':1, 'W':1, 'X':1, 'Y':1, 'Z':1})

In [35]:
letter.shape

(19999, 17)

In [36]:
letter.head()

,lettr,x-box,y-box,width,height,pixels,x-bar,y-bar,x2bar,y2bar,xybar,x2ybr,xy2br,x ege,xegvy,y-ege,yegvx
0,0,5,12,3,7,2,10,5,5,4,13,3,9,2,8,4,10
1,0,4,11,6,8,6,10,6,2,6,10,3,7,3,7,3,9
2,1,7,11,6,6,3,5,9,4,6,4,4,10,6,10,2,8
3,0,2,1,3,1,1,8,6,6,6,6,5,9,1,7,5,10
4,1,4,11,5,8,3,8,8,6,9,5,6,6,0,8,9,7

In [37]:
letter.isin([' ?']).sum(axis=0)

lettr     0
x-box     0
y-box     0
width     0
height    0
pixels    0
x-bar     0
y-bar     0
x2bar     0
y2bar     0
xybar     0
x2ybr     0
xy2br     0
x ege     0
xegvy     0
y-ege     0
yegvx     0
dtype: int64

In [38]:
letter.isna().sum()

lettr     0
x-box     0
y-box     0
width     0
height    0
pixels    0
x-bar     0
y-bar     0
x2bar     0
y2bar     0
xybar     0
x2ybr     0
xy2br     0
x ege     0
xegvy     0
y-ege     0
yegvx     0
dtype: int64

In [39]:
letter['lettr'].value_counts()

1    10059
0     9940
Name: lettr, dtype: int64

### CHESS Dataset

In [40]:
chess = pd.read_csv('krkopt.data')
chess.columns = ['White King file', 'White King rank', 'White Rook file',
                 'White Rook rank', 'Black King file', 
                 'Black King rank', 'Optimal Depth of Win']
chess.head()

,White King file,White King rank,White Rook file,White Rook rank,Black King file,Black King rank,Optimal Depth of Win
0,a,1,c,1,c,2,draw
1,a,1,c,1,d,1,draw
2,a,1,c,1,d,2,draw
3,a,1,c,2,c,1,draw
4,a,1,c,2,c,3,draw

In [41]:
chess.isin(['?']).sum(axis=0)

White King file         0
White King rank         0
White Rook file         0
White Rook rank         0
Black King file         0
Black King rank         0
Optimal Depth of Win    0
dtype: int64

In [42]:
chess.isna().sum()

White King file         0
White King rank         0
White Rook file         0
White Rook rank         0
Black King file         0
Black King rank         0
Optimal Depth of Win    0
dtype: int64

In [43]:
chess.shape

(28055, 7)

#### One Hot Encoding

In [44]:
chess['White King file'].unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [45]:
chess['White King file'] = chess['White King file'].map({'a': 0, 'b': 1,
                                                        'c': 2, 'd': 3})

In [46]:
chess['White Rook file'].unique()

array(['c', 'd', 'e', 'f', 'g', 'h', 'a', 'b'], dtype=object)

In [47]:
chess['White Rook file'] = chess['White Rook file'].map({'a': 0, 'b': 1,
                                                        'c': 2, 'd': 3,
                                                        'e': 4, 'f': 5,
                                                        'g': 6, 'h': 7})

In [48]:
chess['Black King file'].unique()

array(['c', 'd', 'e', 'f', 'g', 'h', 'a', 'b'], dtype=object)

In [49]:
chess['Black King file'] = chess['Black King file'].map({'a': 0, 'b': 1,
                                                        'c': 2, 'd': 3,
                                                        'e': 4, 'f': 5,
                                                        'g': 6, 'h': 7})

In [50]:
chess['Optimal Depth of Win'].unique()

array(['draw', 'zero', 'one', 'two', 'three', 'four', 'five', 'six',
       'seven', 'eight', 'nine', 'ten', 'eleven', 'twelve', 'thirteen',
       'fourteen', 'fifteen', 'sixteen'], dtype=object)

In [51]:
chess['Optimal Depth of Win'] = chess['Optimal Depth of Win'].map({
    'zero': 1, 'one': 1, 'two': 1, 'three': 1, 'four': 1, 'five': 1,
    'six': 1, 'seven': 1, 'eight': 1, 'nine': 0, 'ten': 0, 'eleven': 0,
    'twelve': 0, 'thirteen': 0, 'fourteen': 0, 'fifteen': 0, 
    'sixteen': 0, 'draw': 0})

In [52]:
chess.head()

,White King file,White King rank,White Rook file,White Rook rank,Black King file,Black King rank,Optimal Depth of Win
0,0,1,2,1,2,2,0
1,0,1,2,1,3,1,0
2,0,1,2,1,3,2,0
3,0,1,2,2,2,1,0
4,0,1,2,2,2,3,0

In [69]:
chess['Optimal Depth of Win'].value_counts()

0    24246
1     3809
Name: Optimal Depth of Win, dtype: int64

### NURSERY Dataset

In [53]:
nurse = pd.read_csv('nursery.data')
nurse.columns = ['parents', 'has_nurs', 'form', 'children', 'housing', 'finance', 'social', 'health', 'suggestion']
nurse.head()

,parents,has_nurs,form,children,housing,finance,social,health,suggestion
0,usual,proper,complete,1,convenient,convenient,nonprob,priority,priority
1,usual,proper,complete,1,convenient,convenient,nonprob,not_recom,not_recom
2,usual,proper,complete,1,convenient,convenient,slightly_prob,recommended,recommend
3,usual,proper,complete,1,convenient,convenient,slightly_prob,priority,priority
4,usual,proper,complete,1,convenient,convenient,slightly_prob,not_recom,not_recom

In [54]:
nurse.shape

(12959, 9)

In [55]:
nurse.isin(['?']).sum(axis=0)

parents       0
has_nurs      0
form          0
children      0
housing       0
finance       0
social        0
health        0
suggestion    0
dtype: int64

In [56]:
nurse.isna().sum()

parents       0
has_nurs      0
form          0
children      0
housing       0
finance       0
social        0
health        0
suggestion    0
dtype: int64

#### One Hot Encoding

In [57]:
nurse['parents'] = nurse['parents'].map({'usual': 0, 'pretentious': 1,
                                        'great_pret': 2})

In [58]:
nurse['has_nurs'] = nurse['has_nurs'].map({'very_crit': 0, 'critical': 1,
                                          'improper': 2, 'less_proper': 3,
                                          'proper':4})

In [59]:
nurse['form'] = nurse['form'].map({'foster': 0, 'incomplete': 1,
                                   'complete': 2, 'completed': 3})

In [60]:
nurse['children'] = nurse['children'].map({'more': 0, '1': 1,
                                           '2': 2, '3': 3})

In [61]:
nurse['housing'] = nurse['housing'].map({'critical': 0, 
                                         'less_conv': 1, 'convenient': 2})

In [62]:
nurse['finance'] = nurse['finance'].map({'inconv': 0, 'convenient': 1})

In [63]:
nurse['social'] = nurse['social'].map({'problematic': 0, 
                                       'slightly_prob': 1, 
                                       'nonprob': 2})

In [64]:
nurse['health'] = nurse['health'].map({'not_recom': 0, 
                                       'recommended': 1, 
                                       'priority': 2})

In [65]:
nurse['suggestion'] = nurse['suggestion'].map({'not_recom': 0, 
                                              'recommend': 1,
                                              'very_recom' : 2,
                                              'priority': 3, 
                                              'spec_prior': 4})

In [66]:
nurse.head()

,parents,has_nurs,form,children,housing,finance,social,health,suggestion
0,0,4,2,1,2,1,2,2,3
1,0,4,2,1,2,1,2,0,0
2,0,4,2,1,2,1,1,1,1
3,0,4,2,1,2,1,1,2,3
4,0,4,2,1,2,1,1,0,0

## Occupancy Dataset

In [67]:
occupancy = pd.read_csv('occupancy_data.txt')
occupancy.head()

,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
1,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
2,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
3,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1
4,2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1
5,2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1

In [68]:
occupancy = occupancy.drop('date',axis=1)
occupancy.head()

   Temperature  Humidity  Light     CO2  HumidityRatio  Occupancy
1        23.18   27.2720  426.0  721.25       0.004793          1
2        23.15   27.2675  429.5  714.00       0.004783          1
3        23.15   27.2450  426.0  713.50       0.004779          1
4        23.15   27.2000  426.0  708.25       0.004772          1
5        23.10   27.2000  426.0  704.50       0.004757          1

In [70]:
occupancy.shape

(8143, 6)

In [71]:
occupancy['Occupancy'].value_counts()

0    6414
1    1729
Name: Occupancy, dtype: int64